import React from 'react';
import QA from "@/interface/Help/QA";
import Chapter from "@/interface/Help/Chapter";

function Help() {
    const qasMain = [
        {
            question: 'Как начать работу с приложением?',
            answer: 'Для начала работы с приложением необходимо задать условия задачи. Сделать это можно во ' +
                'вкладке "Условия задачи". Ввод коэффициентов целевой функции и ограничений возможен как из файла, ' +
                'так и вручную с помощью специального конструктора.\nПосле ввода всех желаемых параметров нажмите кнопку ' +
                '"Применить" внизу вкладки, а затем перейдите к желаемому методу решения.'
        },
        {
            question: 'Как ввести коэффициенты с помощью файла?',
            answer: 'Перейдите во вкладку "Условия задачи" и в блоке "Коэффициенты целевой функции и ограничений" ' +
                'найдите кнопку "Загрузить из файла" и следуйте инструкциям.'
        },
        {
            question: 'Как сохранить текущее условие задачи в файл?',
            answer: 'Во вкладке "Условия задачи" в блок "Коэффициенты целевой функции и ограничений" найдите кнопку ' +
                'найдите кнопку "Сохранить в файл" и следуйте инструкциям.'
        },
        {
            question: 'Почему недоступно использование того или иного метода?',
            answer: 'Возможно, не выполнены обязательные условия для применения выбранного метода. Обратите внимание ' +
                'на предупреждения вверху вкладки, отмеченные красным цветом.'
        },
        {
            question: 'Где можно узнать текущее состояние параметров задачи?',
            answer: 'Во вкладке "Условия задачи" в блоке, расположенном в самом верху страницы.'
        }
    ]
    const qasTables = [
        {
            question: 'Как выбрать другой опорный элемент?',
            answer: 'Возможные опорные элементы подсвечены на каждой таблице светло-зелёным цветом. Нажмите на один из ' +
                'них, а затем нажмите на кнопку "Применить". Она появляется при наведении на блок, содержащий информацию ' +
                'о конкретном шаге работы алгоритма, и располагается в правом нижнем углу. Обратите внимание: попытка ' +
                'выбрать элемент, не являющийся возможным опорным, будет проигнорирована!'
        }
    ]
    const qasGraphical = [
        {
            question: 'Как детальнее рассмотреть получившийся график?',
            answer: 'Перемещаться по координатной сетке можно с помощью мыши, зажав при этом клавишу Ctrl. Приближать/' +
                'отдалять изображение можно колёсиком мышки.'
        }
    ]

    return (
        <div className="flex justify-start items-center h-full w-full text-xl flex-col p-2">
            <h1 >Справочная информация</h1>
            <div className="flex justify-start items-start flex-col gap-4 w-2/3 mt-10">
                <Chapter title="Общие вопросы"/>
                {
                    qasMain.map((qa, index) =>
                        <QA question={qa.question} answer={qa.answer} key={index}/>
                    )
                }
                <Chapter title="Работа с таблицей коэффициентов"/>
                {
                    qasTables.map((qa, index) =>
                        <QA question={qa.question} answer={qa.answer} key={index}/>
                    )
                }
                <Chapter title="Графический метод"/>
                {
                    qasGraphical.map((qa, index) =>
                        <QA question={qa.question} answer={qa.answer} key={index}/>
                    )
                }
            </div>
        </div>
    );
}

export default Help;